Backend/app/controllers/entries_controller.rb

SELECT  `entries`.* FROM `entries`  WHERE `entries`.`id` = 5 LIMIT 1
---
	def show
		@entry = Entry.find(params[:id])

INSERT INTO `entries` (`content`, `created_at`, `device`, `message`, `updated_at`, `user_id`) VALUES ('one', '2015-01-31 18:04:13', 'web', 'one\r\n', '2015-01-31 18:04:13', 1)
---
	def create
		@entry = Entry.new(entry_params)

		if @entry.save

SELECT  `entries`.* FROM `entries`  WHERE `entries`.`id` = 1 LIMIT 1
---
	def edit
		@entry = Entry.find(params[:id])

SELECT  `entries`.* FROM `entries`  WHERE `entries`.`id` = 1 LIMIT 1
UPDATE `entries` SET `content` = 'asfaasdasdad', `updated_at` = '2015-01-31 20:04:39' WHERE `entries`.`id` = 3
---
	def update
		@entry = Entry.find(params[:id])

		if @entry.update(entry_params)