Backend/app/controllers/sessions_controller.rb

INSERT INTO `users` (`created_at`, `name`, `provider`, `uid`, `updated_at`) VALUES ('2015-01-31 12:28:35', 'Gohar Irfan', 'facebook', '10153050538102744', '2015-01-31 12:28:35')
SELECT  `users`.* FROM `users`  WHERE `users`.`provider` = 'facebook' AND `users`.`uid` = '10153050538102744'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)